In [1]:
import pandas as pd

In [2]:
value=[(1,2),(4,5),(33,4)]

In [3]:
df=pd.DataFrame(value,columns=['a','b'])

In [4]:
df

    a  b
0   1  2
1   4  5
2  33  4

In [6]:
df.to_csv('ne3w.csv')

In [7]:
df.shape

(3, 2)

In [8]:
df.head(3)

    a  b
0   1  2
1   4  5
2  33  4

In [9]:
df.tail(1)

    a  b
2  33  4

In [10]:
df=pd.read_csv(r'E:\Machinelearning\Applied Machine Learning Course\7.3 - Key Operations on Data Frames\3_Key operations on Dataframes-20190814T075446Z-001\3_Key operations on Dataframes\new.csv')

In [11]:
 df

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

In [13]:
x=df.groupby('event')

In [14]:
x

In [17]:
x.get_group('Snow')

   Unnamed: 0       day  temperature  windspeed event
2           2  1/3/2017           28          2  Snow
3           3  1/4/2017           24          7  Snow

In [21]:
x.max()

       Unnamed: 0       day  temperature  windspeed
event
Rain            4  1/5/2017           32          6
Snow            3  1/4/2017           28          7
Sunny           5  1/6/2017           35          7

In [22]:
x.mean()

       Unnamed: 0  temperature  windspeed
event
Rain          2.0         32.0        5.0
Snow          2.5         26.0        4.5
Sunny         3.0         33.0        4.5

In [23]:
x.describe()

      Unnamed: 0                                           temperature        \
           count mean       std  min   25%  50%   75%  max       count  mean
event
Rain         2.0  2.0  2.828427  0.0  1.00  2.0  3.00  4.0         2.0  32.0
Snow         2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0         2.0  26.0
Sunny        2.0  3.0  2.828427  1.0  2.00  3.0  4.00  5.0         2.0  33.0

      ...              windspeed
      ...    75%   max     count mean       std  min   25%  50%   75%  max
event ...
Rain  ...   32.0  32.0       2.0  5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow  ...   27.0  28.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny ...   34.0  35.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

[3 rows x 24 columns]

In [24]:
import pandas as pd

In [25]:
value=pd.DataFrame({
    "a":[1,2,3], 
    "b":[12,3,4]
})

In [26]:
value

   a   b
0  1  12
1  2   3
2  3   4

In [27]:
value=[(1,12),(2,3),(3,4)]

In [28]:
x=pd.DataFrame(value,columns=['a','b'])

In [29]:
x

   a   b
0  1  12
1  2   3
2  3   4

In [40]:
p=pd.DataFrame([(1),(33),(44),(2)],index=[22,4,5,1],columns=['a'])

In [44]:
p.iloc[3]

a    2
Name: 1, dtype: int64

In [42]:
p

     a
22   1
4   33
5   44
1    2

In [45]:
import numpy as np

In [46]:
a=np.array([[1,2,3],[33,2,4]])

In [47]:
a

array([[ 1,  2,  3],
       [33,  2,  4]])

In [48]:
a.shape

(2, 3)